package lesson2;
/*
4.     Написать метод, которому в качестве аргументов передается строка и число, метод должен отпечатать
в консоль указанную строку, указанное количество раз;
*/
public class StrokaNRaz {
    public static void main(String[] args) {
        String str="Hello";
        int n=5;
        int i;
        for(i=1; i<=n; i++){
            System.out.println("str");
        }
    }
}
